O objetivo desta tarefa é encontrar algum tipo de relação entre o atributo education e o atributo income da base de dados do censo <br>

Carregue o arquivo census.csv<br>

Crie um novo dataframe com o pandas utilizando somente esses dois campos<br>

Você pode utilizar o comando groupby do pandas para agrupar os dados, ou seja, a quantidade de registros baseado nesses dois atributos. Acesse aqui a documentação<br>

Identifique o nível de educação que possuem as maiores e menores rendas. Lembre-se que nesta base de dados a renda assume somente os valores >50 e <=50<br>

In [10]:
import pandas as pd

In [11]:
dados = pd.read_csv('census.csv')
dados.head()

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [12]:
dados_segmentados = dados[['education','income']]

In [13]:
dados_segmentados.head()

    education  income
0   Bachelors   <=50K
1   Bachelors   <=50K
2     HS-grad   <=50K
3        11th   <=50K
4   Bachelors   <=50K

In [14]:
dados_segmentados_2 = dados_segmentados.groupby(['education','income'])['education'].count()

In [15]:
dados_segmentados_2.index

MultiIndex([(        ' 10th', ' <=50K'),
            (        ' 10th',  ' >50K'),
            (        ' 11th', ' <=50K'),
            (        ' 11th',  ' >50K'),
            (        ' 12th', ' <=50K'),
            (        ' 12th',  ' >50K'),
            (     ' 1st-4th', ' <=50K'),
            (     ' 1st-4th',  ' >50K'),
            (     ' 5th-6th', ' <=50K'),
            (     ' 5th-6th',  ' >50K'),
            (     ' 7th-8th', ' <=50K'),
            (     ' 7th-8th',  ' >50K'),
            (         ' 9th', ' <=50K'),
            (         ' 9th',  ' >50K'),
            (  ' Assoc-acdm', ' <=50K'),
            (  ' Assoc-acdm',  ' >50K'),
            (   ' Assoc-voc', ' <=50K'),
            (   ' Assoc-voc',  ' >50K'),
            (   ' Bachelors', ' <=50K'),
            (   ' Bachelors',  ' >50K'),
            (   ' Doctorate', ' <=50K'),
            (   ' Doctorate',  ' >50K'),
            (     ' HS-grad', ' <=50K'),
            (     ' HS-grad',  ' >50K'),
            (     ' Masters', ' <=50K'),
            (     ' Masters',  ' >50K'),
            (   ' Preschool', ' <=50K'),
            ( ' Prof-school', ' <=50K'),
            ( ' Prof-school',  ' >50K'),
            (' Some-college', ' <=50K'),
            (' Some-college',  ' >50K')],
           names=['education', 'income'])

In [16]:
bacharelado_menos50k = dados_segmentados_2[' Bachelors', ' <=50K']
bacharelado_mais50k = dados_segmentados_2[' Bachelors', ' >50K']
print(bacharelado_menos50k, bacharelado_mais50k)
total = bacharelado_mais50k + bacharelado_menos50k

3134 2221

In [17]:
#porcentagem bacharelados com mais de 50k
bacharelado_mais50k/total * 100

41.47525676937442

In [18]:
#porcentagem bacharelados com menos de 50k
bacharelado_menos50k/total * 100

58.52474323062559

O objetivo deste exercício é calcular o coeficiente e a taxa de evasão utilizando a tabela abaixo. Faça os cálculos manuais e depois implemente em Python.

<img src="tabela.png" alt="" style="margin-top: 30px;">

Coeficiente evasão = Número de alunos evadidos/ numero inicial de matriculas
taxa evasão = coeficiente evasão * 1000

In [20]:
tabela = {
    'Ano_graduacao': ['1º','2º','3º','4º','Total'],
    'Matricula_março': [70,50,47,23,190],
    'Matricula_novembro': [65,48,40,22,175],
}
df_tabela = pd.DataFrame(tabela)
df_tabela.head()

  Ano_graduacao  Matricula_março  Matricula_novembro
0            1º               70                  65
1            2º               50                  48
2            3º               47                  40
3            4º               23                  22
4         Total              190                 175

In [23]:
df_tabela['Evasão'] = (df_tabela['Matricula_março'] - df_tabela['Matricula_novembro']) / df_tabela['Matricula_março'] * 100

In [24]:
df_tabela

  Ano_graduacao  Matricula_março  Matricula_novembro     Evasão
0            1º               70                  65   7.142857
1            2º               50                  48   4.000000
2            3º               47                  40  14.893617
3            4º               23                  22   4.347826
4         Total              190                 175   7.894737